app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
---
INSERT INTO "school_classes" ("room_number", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_number", 234], ["title", "Math"], ["created_at", "2020-10-17 18:55:39.544248"], ["updated_at", "2020-10-17 18:55:39.544248"]]

    def show
        @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        if @school_class
            @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 1234], ["updated_at", "2020-10-17 19:23:03.648133"], ["id", 8]]

    def set_school_class
      @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]