app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Odie"], ["last_name", "McKraken"], ["created_at", "2020-10-17 18:22:44.133110"], ["updated_at", "2020-10-17 18:22:44.133110"]]
---
    def create
        @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Muazzam H"], ["updated_at", "2020-10-17 05:40:18.718907"], ["id", 3]]
---
    def update
        if @student
            @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def set_student
        @student = Student.find_by_id(params[:id])